// mockData.ts
export const product = {
  id: 1,
  name: "Поршневой палец",
  parameters: [
    {
      id: 1,
      name: "Диаметр",
      unit: "мм",
      batches: [
        [10.01, 10.02, 10.0, 10.03, 10.01],
        [10.02, 10.01, 10.02, 10.04, 10.03],
        [10.01, 10.0, 10.01, 10.02, 10.01],
      ],
    },
    {
      id: 2,
      name: "Линейный размер",
      unit: "мм",
      batches: [
        [50.1, 50.2, 50.0, 50.1, 50.2],
        [50.0, 50.1, 50.1, 50.2, 50.1],
      ],
    },
  ],
};
